var rnd = function(min, max) {
  return Math.floor( Math.random() * (max - min) ) + min;
};
var rndListItem = function(array){
  return array[rnd(0,array.length)];
};

var actions = {
    object:function(){
      return rndListItem([
        "קורל,",
        "נוי,",
        "לינוי,",
        "לינוי,",
        "נוגה,",
        "אורלי,"
      ]);
    },
    adobj:function(){
      return rndListItem([
        "בת 23,",
        "בת 24,",
        "בת 25,",
        "בת 26,",
        "בת 27,"
      ]);
    },
    witha:function(){
      return rndListItem([
        "אוהבת המבורגר,",
        "אוהבת בירה,",
        "אוהבת יין טוב, ",
        "אוהבת להנות,"
      ]);
    },
    madeBy:function(){
      return rndListItem([
        " קפה טוב,",
        "פואטרי סלאם,",
        "פירות,",
        "שקיעות,"
      ]);
    },
    whileThey:function(){
      return rndListItem([
        "נטפליקס,",
        "סרטים,",
        "טיולים,",
        "סדרות,"
      ]);
    },
    because:function(){
      return rndListItem([
        "חברים זה החיים! ",
        "ברוקלין 9-9! ",
        "איך פגשתי את אמא! ",
        "מכירה את כל המשרד בעל-פה, "
      ]);
    },
    but:function(){
      return rndListItem([
        "למרות שהמלריה עוד לא התחילה",
        "אבל בסוף התברר שהוא היה רק אשלייה",
        "למרות שהוא בכלל חייזר רב-מימדי עם "+rnd(10,35)+" זרועות ו-"+rnd(10,120)+" פרציפלוחות",
        "אך כל המציאות הייתה רק חלום שלו",
        "אבל זה לא עבד",
        "ולמרות הציפיות זה לא מצחיק בכלל",
        "אבל הם בטעות השמידו את היקום כולו",
        "וזה עבד מעולה, רק שהם חיו בתוך קונספירציה ענקית של האילומינטי כל הזמן הזה",
        "אבל זה יצא מגעיל מאוד",
        "אך ישו אמר להם שזה רע מאוד",
        "אך הגננת אמרה להם שזה לא יפה וביקשה מהם בנימוס להתנצל",
        "אך התרחשה תאונה וכולם מתו",
        "אבל זה לא נשמע טוב",
        "נגיד.",
        "אבל המפיק הגדול השמיד הכל"
      ]);
    },
    voice:function(){
      return rndListItem([
        "ואז היא אמרה",
        "ואז הוא אמר",
        "ואז נשמע קול מיסתורי",
        "וכולם ידעו בליבם כי",
        "ומאז כולם יודעים ש",
      ]);
    },
    objes:function(){
      return rndListItem([
        "ישועים",
        "מוסלמים",
        "יצורים עליונים",
        "חתולים",
        "אנשים גבוהים",
        "אנשים נמוכים",
        "מחוננים",
        "מחונחנים",
        "חנונים",
        "הילד שיצר את הדבר הזה וחבריו",
        "מאזניים"
      ]);
    },
    objes_adobjs:function(){
      return rndListItem([
        "הם תמיד",
        "הם מאוד",
        "הם אף פעם לא",
        "וזה תמיד נכון, הם",
        "הם",
        "הם תמיד, אבל תמיד",
        "הם אף פעם, אבל אף פעם לא"
      ]);
    },
    adobjs:function(){
      return rndListItem([
        "טיפשים",
        "נוטים להתפוצץ",
        "מיוחדים",
        "שונים",
        "חולים במחלת המלריה",
        "מאמינים אדוקים",
        "מתפללים לנמריה",
        "מקדשים את קדושת נמריה",
        "מהללים את נמריה",
        "רואים את השמש השנייה",
        "חובבי גרגמל",
        "פרציפלוחות",
        "נשמעים טוב",
        "זה שם תואר, נגיד. ואני צריך להכניס אותו, נגיד. וזה לא נשמע טוב, נגיד."
      ]);
    },
    butSome:function(){
      return rndListItem([
        "אבל מעטים יחלקו על תודעה זו בגלל שהם מאמינים בפילוסופיה ה",
        "כה אמרה האישה ה",
        "לעומת זאת ישנן גישות שמתנגדות לכך כמו הגישה ה",
        "למרות שזה לא נשמע טוב לפי המכוערת ה",
        "למרות שזה לא נשמע טוב לפי המשיכה ה",
        "למרות שזה לא נשמע טוב לפי העז ה"
      ]);
    },
    theWayOf:function(){
      return rndListItem([
        "ברברית",
        "פילוסופית",
        "קומוניסטית",
        "אמריקאית",
        "נאצית",
        "אמריקאית",
        "קפיטליסטית",
        "נאוקלסית",
        "פרימדרנית",
        "אומנותית",
        "מיוחדת"
      ]);
    },
    time:function(){
      return rndListItem([
        "בחצות",
        "בזריחה",
        "כשהשמש השנייה זורחת",
        "כשהיד מצביעה על יבשת אסיה",
        "בביאת המשיח",
        "כשמוחמד יחזור מן המתים",
        "כשחיה ושמשון מתאחדים ויוצרים את חיה הקדמונית",
        "כשצ'אק נוריס(הוא גם פועל)"
      ]);
    },
    youMay:function(){
      return rndListItem([
        "אפשר לראות את",
        "אפשר להבחין בנוכחות",
        "מרגישים בנשמה את",
        "אפשר לראות את",
        "מוחמד יוצא לסיבוב הופעות עם",
        "קללה מגיעה מנשמתו של",
        "הוא יורד לכדור הארץ ומציג את עצמו בתור",
        "על כפות המאזניים נעמד",
        "לא ישמע טוב"
      ])
    },
    name:function(){
      return rndListItem([
        "המשיח",
        "ישו",
        "מוחמד",
        "הפרציפלוחה הכי שאי אפשר אפילו",
        "צ'אק נוריס",
        "ילד מחונן",
        "ילד מחונחן",
        "אורי",
        "מחולל המשפטים הזה ממש",
        "זרובבל",
        "מרגול",
        "צ'ארלס דרווין"
      ])
    },
    actn:function(){
      return rndListItem([
        "אוכל פרציפלוחות תמימות עם",
        "מגרד את הגב יחד עם",
        "מגרד את הגב של",
        "מוריד מערכו של",
        "מקלל את",
        "מטיל קללה על",
        "מלמד אלגברה את",
        "מרגל אחרי",
        "אוכל את"
      ])
    },
    psv:function(){
      return rndListItem([
        "קשר רציני",
        "לא מחפשת משחקים",
        "לרציניים בלבד"
      ])
    }
};

module.exports =  function(){
  with(actions){
    var str = object();
    str += adobj() + " " + witha() + "</br>";
    str += madeBy() + " " + whileThey() + " " + because();
    str += but() + ", ";
    str += voice()+":\""+ objes() + ", " + objes_adobjs() + " " + adobjs() + "\", ";
    str += butSome() + theWayOf()
    str += time() + " " + youMay() + " " + name();
    str += " כשהוא "+ actn() + " " + name() + " " + psv();
    return str;
  }
};
